##############################################################
## [투빅스 17기 정규세션] 5주차 Time-Series 과제 - 17기 이지수 ##
##############################################################

# 패키지 설치
library(forecast)

-
#---------------------- 데이터 불러오기---------------------------

data_king <- read.csv('C:/Users/jisuj/Desktop/tobigs/[투빅스 17기 정규세션] 5주차 Time-Series_16기 이예림/과제/kingage.csv')

#시계열 데이터로 변환
data_ts <- ts(data_king)
plot.ts(data_ts) #전체적인 추세가 있다고 판단 --> 차분

#시계열 데이터를 차분 (1번 차분)
diff1_ts <- diff(data_ts, differences = 1)
plot.ts(diff1_ts)
#차분을 한번만 해도 정상화 패턴을 확인할 수 있음


# ---------------------- 1. 모형 식별---------------------------

par(mfrow=c(2,1))
acf(diff1_ts, main = "ACF")
pacf(diff1_ts, main = "PACF")

#ACF에서는 첫번째 시점 이후 절단된 형태로 보인다.
#PACF의 그래프는 지수적으로 감소하는 것으로도 보이고 세번째 시점 이후로 절단된 형태로도 보인다.

#----------------------  2. 모수 추정---------------------------
#ARIMA(0,1,1)모델을 토대로 예측을 하였지만, 17개의 예측값 모두 같은 값을 보여 잘못된 결과라고 생각했고, 따라서 p를 1이상으로 고려함.

#ARIMA(1,1,1), ARIMA(1,1,2), ARIMA(1,1,0) 모형을 생각해볼 수 있다.
fit1_ts <- arima(data_ts, order = c(1, 1, 1))
fit2_ts <- arima(data_ts, order = c(1, 1, 2))
fit3_ts <- arima(data_ts, order = c(2, 1, 1))

fit1_ts
fit2_ts
fit3_ts

#ARIMA(1,1,1)의 AIC : 345.74
#ARIMA(1,1,2)의 AIC : 347.57
#ARIMA(2,1,1)의 AIC : 347.3

#----------------------  3. 모형 적합성 진단---------------------------

tsdiag(fit1_ts)
# p-value가 기준선 위에 위치하고
# 잔차의 ACF에서 자기상관성이 보이지 않음
# 따라서 fit1_ts모형이 좋다고 생각한다.

tsdiag(fit3_ts)

#----------------------  4. 모형 확정 및 예측 (예측값 17개 출력하기)---------------------------

#data_ts.forecasts <- forecast(fit1_ts, h = 17)
#data_ts.forecasts

#fit1_ts모형의 AIC가 가장 좋았지만, 예측값이 9번째 이후로 모두 같은 값이어서 두번째로 AIC낮은 값을 갖는 fit3_ts를 최종 모델로 확정했습니다.
data_ts.forecasts2 <- forecast(fit3_ts, h = 17)
data_ts.forecasts2


#> data_ts.forecasts2
# Point Forecast    Lo 80    Hi 80    Lo 95     Hi 95
# 43       65.81480 46.55794 85.07166 36.36398  95.26563
# 44       69.31805 48.83392 89.80218 37.99028 100.64583
# 45       68.03111 47.22791 88.83432 36.21536  99.84687
# 46       67.46187 45.99826 88.92548 34.63611 100.28763
# 47       67.62586 45.38021 89.87151 33.60407 101.64764
# 48       67.71640 44.76973 90.66307 32.62250 102.81030
# 49       67.69628 44.09113 91.30143 31.59532 103.79725
# 50       67.68214 43.42998 91.93430 30.59167 104.77261
# 51       67.68448 42.79884 92.57011 29.62518 105.74377
# 52       67.68665 42.18403 93.18928 28.68375 106.68955
# 53       67.68640 41.58186 93.79095 27.76294 107.60986
# 54       67.68607 40.99309 94.37906 26.86268 108.50947
# 55       67.68610 40.41730 94.95489 25.98207 109.39012
# 56       67.68615 39.85345 95.51884 25.11972 110.25257
# 57       67.68614 39.30077 96.07152 24.27446 111.09783
# 58       67.68614 38.75863 96.61364 23.44534 111.92694
# 59       67.68614 38.22648 97.14579 22.63148 112.74080